import pandas as pd


df1=pd.DataFrame({'kiracılar':['ali','ahmet','ayse','oya'],'bloklar':['a','b','b','c']})
print(df1)
print("-------------------------------------------------------------------------------")
df2=pd.DataFrame({'kiracılar':['ali','ahmet','ayse','oya'],'tasinma':['2010','2011','2012','2013']})
print(df2)
print("-------------------------------------------------------------------------------")
a=pd.merge(df1,df2)
print(a)
print("-------------------------------------------------------------------------------")